Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>PDRUNCFG1</name>
          <description>Run configuration 1</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PQ_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PQ_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC0_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC0_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC1_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC1_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER_SRAM_APD</name>
              <description>Array power</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER_SRAM_PPD</name>
              <description>Peiph power</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPCACHE_REGF_APD</name>
              <description>Array power</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPCACHE_REGF_PPD</name>
              <description>Peiph power</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPTCM_REGF_APD</name>
              <description>Array power</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSPTCM_REGF_PPD</name>
              <description>Peiph power</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROM_PD</name>
              <description>array power and periph power</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_SLEEP</name>
              <description>Needed when vddcore can be smaller than 0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <description>RAM Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP_MODE</name>
                  <description>RAM Sleep Mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
