Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>PRSTCTL1</name>
          <description>peripheral reset control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB18100FF</resetValue>
          <resetMask>0xB18100FF</resetMask>
          <fields>
            <field>
              <name>HSGPIO0_RST</name>
              <description>HSGPIO0 reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO1_RST</name>
              <description>HSGPIO1 reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO2_RST</name>
              <description>HSGPIO2 reset control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO3_RST</name>
              <description>HSGPIO3 reset control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO4_RST</name>
              <description>HSGPIO4 reset control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO5_RST</name>
              <description>HSGPIO5 reset control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO6_RST</name>
              <description>HSGPIO6 reset control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSGPIO7_RST</name>
              <description>HSGPIO7 reset control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_RST</name>
              <description>CRC reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC0_RST</name>
              <description>DMAC0 reset control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC1_RST</name>
              <description>DMAC1 reset control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU_RST</name>
              <description>MU reset control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA_RST</name>
              <description>SEMA reset control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQME_RST</name>
              <description>FREQME reset control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL2</name>
          <description>peripheral reset control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC001011F</resetValue>
          <resetMask>0xC001051F</resetMask>
          <fields>
            <field>
              <name>CT32BIT0_RST</name>
              <description>CT32BIT0 reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT1_RST</name>
              <description>CT32BIT1 reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT2_RST</name>
              <description>CT32BIT2 reset control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT3_RST</name>
              <description>CT32BIT3 reset control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32BIT4_RST</name>
              <description>CT32BIT4 reset control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT0_RST</name>
              <description>MRT0 reset control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT1_RST</name>
              <description>WWDT1 reset control</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C0_RST</name>
              <description>I3C0 reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOINTCTL_RST</name>
              <description>GPIOINTCTL reset control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIMCTL_RST</name>
              <description>PMC reset control</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
