Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ESPI</name>
      <description>a variant of SPI used by Intel to communicate with its processors via the PCH (aka Southbridge).</description>
      <groupName>ESPI</groupName>
      <baseAddress>0x40037000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x198</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ESPI</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>MCTRL</name>
          <description>Master Control for whole peripheral</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>The main enable for the whole block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled. Block is not operational</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESPI</name>
                  <description>eSPI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPC</name>
                  <description>LPC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PENA</name>
              <description>Port enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P80ENA</name>
              <description>Port 80 enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SBLKENA</name>
              <description>Status block is enabled and mapped according to the STATADDR register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE60MHZ</name>
              <description>If 1, then the functional clock provided to the block is 60MHz vs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTAT</name>
          <description>Master Status of whole peripheral</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PortInt</name>
              <description>Corresponding port is pending interrupt service</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P80Int</name>
              <description>Port80 has had a request and is pending service.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BusRst</name>
              <description>If 1, the entered or left reset. Sticky - must clear.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IrqUpd</name>
              <description>If 1, the bus had an IRQ update completion (for eSPI, IRQPush done; for LPC, SERIRQ done)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WireChg</name>
              <description>If 1, one or more input VWire has changed since last cleared for eSPI; for LPC, SERIRQ started</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Hstall</name>
              <description>If 1, the Host is stalled on a read from or write to a port that has the StallRd or StallWr bit set in the PnCFG register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>If 1, the CRC from the Master did not match the computed CRC</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>If 1, the GPIO in ESPIMISC has had an input change</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Busy</name>
              <description>If 1, the bus is busy.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>InRst</name>
              <description>If 1, the bus in reset.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CompPend</name>
              <description>If 1, completions are pending for eSPI; indicates quiet mode for LPC.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MastPend</name>
              <description>If 1, Mastering is pending (flash or memory)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AlertPend</name>
              <description>If 1, the Alert request pin is pending (whether separate pin or MISO)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Set (enable)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PortInt</name>
              <description>If set to 1, corresponding port will interrupt main processor if matches IRule</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P80Int</name>
              <description>If set to 1, Port80 will interrupt main processor on update from Host.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BusRst</name>
              <description>If 1, a change in Bus Reset status will interrupt main processor.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IrqUpd</name>
              <description>If 1, completion of an IRQ update will interrupt main processor.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WireChg</name>
              <description>If 1, when one or more VWire input has changed, will interrupt main processor.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Hstall</name>
              <description>If 1, when the HStall bit is set in the MSTAT register, will interrupt the main processor.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>If 1, when a CRC error detected, will interrupt main processor.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>If 1, when ESPICFG GPIO changes input value, will interrupt main processor.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Clear (disable)</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PortInt</name>
              <description>If set to 1, clears corresponding port interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P80Int</name>
              <description>If set to 1, clears Port80 interrupt enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BusRst</name>
              <description>If set to 1, clears Reset change interrupt enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IrqUpd</name>
              <description>If set to 1, clears IRQ completion interrupt enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WireChg</name>
              <description>If set to 1, clears Wire Change interrupt enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Hstall</name>
              <description>If set to 1, clears HStall interrupt enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>If set to 1, clears CRCERR interrupt enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>If set to 1, clears GPIO interrupt enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Masked interrupt status (causes)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PortInt</name>
              <description>If set to 1, corresponding port will interrupt main processor if matches IRule</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P80Int</name>
              <description>If set to 1, Port80 will interrupt main processor on update from Host.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BusRst</name>
              <description>If 1, a change in Bus Reset status will interrupt main processor.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IrqUpd</name>
              <description>If 1, completion of an IRQ update will interrupt main processor.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WireChg</name>
              <description>If 1, when one or more VWire input has changed, will interrupt main processor.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Hstall</name>
              <description>If 1, when the HStall bit is set in the MSTAT register, will interrupt the main processor.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>If 1, when a CRC error detected, will interrupt main processor.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>If 1, when ESPICFG GPIO changes input value, will interrupt main processor.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTRL</name>
          <description>Selects DMA for Ports (if used)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA0EN</name>
              <description>Enables the DMA use on the 1st channel for eSPI and selects what triggers it</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled. The DMA channel is not used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGERD_ON_HOST_READ</name>
                  <description>Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGERS_ON_HOST_WRITE</name>
                  <description>Triggers on Host Write complete/ready (whether endpoint and a byte or mailbox and many bytes).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1EN</name>
              <description>Enables the DMA use on the 1st channel for eSPI and selects what triggers it</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled. The DMA channel is not used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGERD_ON_HOST_READ</name>
                  <description>Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGERS_ON_HOST_WRITE</name>
                  <description>Triggers on Host Write complete/ready (whether endpoint and a byte or mailbox and many bytes).</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA0PORT</name>
              <description>Selects which port is operating the DMA: Value Meaning 0 to 7 Is normal port number up to max ports (e</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA1PORT</name>
              <description>Selects which port is operating the DMA: Value Meaning 0 to 7 Is normal port number up to max ports (e</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT0</name>
              <description>Used with Mailbox and Bus master to allow RAM contents to be copied</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT1</name>
              <description>Used with Mailbox and Bus master to allow RAM contents to be copied</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMBASE</name>
          <description>Address of RAM to use for data. This tells the application where the RAM is located (up to 16K addressable).</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZERO</name>
              <description>Always 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAM</name>
              <description>Is location in System memory space where RAM is located that is used by this peripheral's bus master</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAPBASE</name>
          <description>Base0 and Base1 mapped offsets for ports</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASE0</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE1</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQPUSH</name>
          <description>IRQ to drive into Host (with eSPI)</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ</name>
              <description>Set to the IRQ to push across to the Host.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Will go to 1 when complete; this is just the same bit as IrqUpd in MSTAT, which can interrupt using INTENSET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIREWO</name>
          <description>Wire states for Host to see; if LPC, this is the IRQ states.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIRES</name>
              <description>LPC: IRQ states to use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Set to 1 after last write has been pushed out to Host</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
