Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>WIRERO</name>
          <description>Wire states from Host</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIRES</name>
              <description>eSPI: Indicates the latest states from the Host via VWire</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P80STAT</name>
          <description>Port 80 Status (byte and prev byte)</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURR</name>
              <description>Has the Current Port80 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PREV</name>
              <description>Has the previous Port80 value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT</name>
              <description>A counter (set to 0 on enable of p80) which increments with each new value. Will wrap back to 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST</name>
              <description>Resets counter, CNT, back to 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATADDR</name>
          <description>Location of Status block in memory space, if enabled.</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>The offset in Host space for the status block. It must be double-word aligned.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>The meaning is dependent on type of port:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET</name>
                  <description>Is offset from 0 in host memory or IO space.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE1</name>
                  <description>Uses Base1 offset in host memory (see MAPBASE reg)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE2</name>
                  <description>Uses Base2 offset in host memory (see MAPBASE reg)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ESPICAP</name>
          <description>eSPI Capabilities of MCU to send to Host</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPICAP</name>
              <description>SPI mode allowed (host still has to select):</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BSPI_SPI</name>
                  <description>BiSPI and SPI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_SPI</name>
                  <description>FLEXSPI and SPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>any</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXSPD</name>
              <description>Maximum SPI Clock speed to allow (host still chooses):</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMALL_THAN_20M</name>
                  <description>&lt;=20MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL_THAN_25M</name>
                  <description>&lt;=25MHz (may be 24Mhz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL_THAN_33M</name>
                  <description>&lt;=33MHz (may be 30MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL_THAN_50M</name>
                  <description>&lt;=50MHz (may be 48MHz)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL_THAN_66M</name>
                  <description>&lt;= 66MHz (may be 60MHz)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPIN</name>
              <description>Allow Alert to be a pin if the Host wants</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOBOK</name>
              <description>If 1, allow OOB</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMMX</name>
              <description>If 1, allow 128 byte payload for memory and OOB access, else limit to 64</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASHMX</name>
              <description>Selects max Flash payload size to allow:</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE64</name>
                  <description>64 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE128</name>
                  <description>128 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE256</name>
                  <description>256 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE512</name>
                  <description>512 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAF</name>
              <description>If 1, then Slave Attached Flash is possible with this firmware</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFERA</name>
              <description>Min Erase sector size allowed if SAF used</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_2KB</name>
                  <description>Minimally 2KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_4KB</name>
                  <description>Minimally 4KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_8KB</name>
                  <description>Minimally 8KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_16KB</name>
                  <description>Minimally 16KB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ESPICFG</name>
          <description>eSPI Configuration settings from eSPI</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEMSZ</name>
              <description>If 1, will use 128 byte payload for memory and OOB access, else limited to 64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASHSZ</name>
              <description>Indicates max Flash payload size selected using same values as FLASHMX</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPIMOD</name>
              <description>SPI Mode selected by Host</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BSPI</name>
                  <description>BiSPI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI</name>
                  <description>FLEXSPI</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALERT</name>
              <description>Alert is a pin vs. MISO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALERTOD</name>
              <description>Alert is OD as a pin</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPISPD</name>
              <description>SPI Speed selected by Host. See note in section 2.2 on higher eSPI clock speeds and system setup.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LESS_AND_20M</name>
                  <description>20MHz or less</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_25M_24M</name>
                  <description>25MHz or 24MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_33M_30M</name>
                  <description>33MHz or 30MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_50M_48M</name>
                  <description>50MHz or 48MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_66M_60M</name>
                  <description>66MHz or 60MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC</name>
              <description>CRC checking is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSMOK</name>
              <description>Bus Master is OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEMENA</name>
              <description>Channel 0 (memory) is enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VWOK</name>
              <description>Channel 1 (Vwire) is enabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OOBOK</name>
              <description>Channel 2 (OOB) is enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLSHERA</name>
              <description>Flash erase size (and if enabled):</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Flash is not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_4K</name>
                  <description>Erase is 4K</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_64K</name>
                  <description>Erase is 64K</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_4K_64K</name>
                  <description>Erase allows 4K and 64K</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_128K</name>
                  <description>Erase is 128K</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_256K</name>
                  <description>Erase is 256K</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSHOK</name>
              <description>Channel 3 (Flash) is enabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAF</name>
              <description>Is 1 if Slave Attached Flash is enabled. Only possible if SAF is set in ESPICAP.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESPIMISC</name>
          <description>Miscellaneous uses, such as Alert pin as GPIO (when not used for Alert).</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_OE</name>
              <description>Set to 1 to make the Alert/Reset pin an output GPIO, else is input (High-Z)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_OD</name>
              <description>Set to 1 to make the Alert/Reset pin act open-drain when GPIO_OE=1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_OUT</name>
              <description>Used when GPIO_OE=1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_IN</name>
              <description>Is the current state of the Alert/Reset pin, whether in input mode or not</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RISGP</name>
              <description>Reset# is a GPIO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRSAV</name>
              <description>This bit, when set, will employ clock gating for the eSPI side</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
