Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>P0CFG</name>
          <description>no description available</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Type</name>
              <description>The Type field selects how the port interacts with the Host over the eSPI or LPC bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONFIGURED</name>
                  <description>Unconfigured (reset condition)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_END</name>
                  <description>ACPI style Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_INDEX</name>
                  <description>ACPI style Index/Data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_MEM_S</name>
                  <description>Bus Master Mem Single</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_FLASH_S</name>
                  <description>Bus Master Flash Single</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SHARED</name>
                  <description>Mailbox Shared</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SINGLE</name>
                  <description>Mailbox Single</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SPLIT</name>
                  <description>Mailbox Split</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OOB_SPLIT</name>
                  <description>Mailbox OOB Split</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OEM</name>
                  <description>Mailbox OEM</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Direction</name>
              <description>Meaning depends on Type, but generally picks the direction of the port (Host writes, Host reads, or both)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBIntAll</name>
              <description>Mailbox: Map interrupt on Read 1st and Write 1st to every read/write (special will still control 0th and last location)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>StallRd</name>
              <description>Stall on any Read of Index/Data and Mailbox (only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>StallWr</name>
              <description>Stall on any Write of Index/Data and Mailbox</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ErrorIgn</name>
              <description>If 1, the Host will get an error when trying to perform a read or write that is blocked by the Direction field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0STAT</name>
          <description>no description available</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDSTAT</name>
              <description>Status of Host Read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRSTAT</name>
              <description>Status of Host Writes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERR</name>
              <description>Interrupt was caused by error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRD</name>
              <description>Interrupt was caused by Read or 1st Read or Bus master Started.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTWR</name>
              <description>Interrupt was caused by Write or 1st Write or Bus master Started.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC</name>
              <description>Interrupt was caused by: Bit Endpoint Idx/Data Mbox BusMaster/Flash SPC0 CMD Idx Change Write 0 Completed SPC1 - - Read 0 - SPC2 - - Write Last - SPC3 - - Read Last -</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>Cause of INTERR: Bit Endpoint, Idx/Data Mbox BusMaster/Flash ERR0 Host Write Over Host Write or Read invalid for Access Failed From-Host (cannot tell on Memory To-Host, but can for Flash write)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0IRuleStat</name>
          <description>The Port Set Interrupt-Rule and Set User Status register is used to set: The interrupt causes per port. That is, it is used to select what events from the port should cause an interrupt, if any. The user Status bits. The status byte returned to the host will be composed of both these user bits (which the application defines) and automatically generated status. The interrupt masks then are matched by sticky cause bits in PnSTAT (which can be read and then write-1 cleared). The sticky bits are set whether the interrupt is masked or not, but the masks cause an interrupt when the bits are set and the port is int enabled via INTENSET.</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USTAT</name>
              <description>User defined status bits. These are salted into the status register as specified in section 4.1 and 4.6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERR</name>
              <description>Interrupt if an error is detected (classes of error defined in section 2.14)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRD</name>
              <description>Interrupt if Read or 1st Read or Bus master Started.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTWR</name>
              <description>Interrupt if Write or 1st Write or Bus master Finished.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC</name>
              <description>Interrupt if: Bit Endpoint Idx/Data Mbox BusMaster/Flash SPC0 CMD Idx Change Write 0 Completed SPC1 - - Read 0 - SPC2 - - Write Last - SPC3 - - Read Last -</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSTCL</name>
              <description>Status set/clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRST</name>
              <description>Resets the RdStatus and WrStatus in PStatus register</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0ADDR</name>
          <description>The Port Address register is used to set the mapped address in the LPC/eSPI memory space. For normal Ports, this is a 16-bit location in IO space or a 32-bit offset into PCIe address mapped space. It is not used for OOB, Bus Mastering, or Flash; see the PnOMFLEN register for those. For Endpoints, it is the base of a dword (64 bits). For Index/Data, it is the base of a word (32 bits). For mailbox memory, the address is modulus the length of the mailbox (x2 for both directions). So, if a 16-byte mailbox (single), the offset must have bits 3:0 set to 0 (that is &amp;~0xF). If split directions, then normally bits 4:0 would be set to 0 (that is &amp;~0x1F).</description>
          <alternateGroup>PADDR</alternateGroup>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>Offset from 0 or the selected mapped base for matching memory or IO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE_or_ASZ</name>
              <description>The meaning is dependent on type of port:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_FROM_0</name>
                  <description>Is offset from 0 in host memory or IO space.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE0</name>
                  <description>Uses BASE0 offset in host memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE1</name>
                  <description>Uses BASE1 offset in host memory</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDXOFF</name>
              <description>For index/register only: This is the byte offset of the Index relative to the data (before or after, based on IDX1ST)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDX1ST</name>
              <description>For index/data register only: Is 1 if index is lower address than data (e</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0OMFLEN</name>
          <description>The Port OOB, Mastering, Flash length is used for OOB to Host and Bus Mastering and Flash to or from Host. The PnADDR register is not used for either OOB or Bus Mastering. Instead, this register (in same location) is written with byte length message (including address for Mastering and Flash) along with direction. Writing to the SSTCL field of the PIRuleState will notify the Host to perform the transaction. Clearing it before the Host has started a transaction will cancel it, but only if it has not yet seen the Status.</description>
          <alternateGroup>POMFLEN</alternateGroup>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEN</name>
              <description>Length in bytes, 0 relative, to Send for OOB, Send or Retrieve for Mastering, Read or Write for Flash, Erase (in blocks) for Flash, or read data for SAF read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>Transfer request as: Type Value Meaning OOB 0 To Host OOB 1, 2, 3 Not used Master 0 To Host 32 (Host reads w/32-bit address) Master 1 To Host 64 (Host reads w/64-bit address) Master 2 From Host 32 (Host writes w/32-bit address) Master 3 From Host 64 (Host writes w/64-bit address) MAF Flash 1 Read Flash (location in RAM) MAF Flash 2 Write Flash (location in RAM) MAF Flash 3 Erase Flash (sector in RAM) SAF 0 Completion fail SAF 1 Completion with data SAF 2 Completion with no data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DataIn</name>
          <description>no description available</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_LEN</name>
              <description>Meaning is dependent on type of port: If endpoint or index/data: is data byte If Mailbox or Bus master or Flash: is count in last message, 0 relative If SAF, is count in last message including address (so, +4), 0 relative</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction of last access: 0 = Read By Host 1 = Write By Host</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDX</name>
              <description>Index of last access (ie</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DataOut</name>
          <description>no description available</description>
          <alternateGroup>PDataOut</alternateGroup>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to send to Host. Application can tell when taken via the PnStatus register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0RAMUse</name>
          <description>no description available</description>
          <alternateGroup>PRAMUse</alternateGroup>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>This is the word offset into the RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>This is the length of the mailbox or mastering area as 4&lt;&lt;LEN per direction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CFG</name>
          <description>no description available</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Type</name>
              <description>The Type field selects how the port interacts with the Host over the eSPI or LPC bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONFIGURED</name>
                  <description>Unconfigured (reset condition)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_END</name>
                  <description>ACPI style Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_INDEX</name>
                  <description>ACPI style Index/Data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_MEM_S</name>
                  <description>Bus Master Mem Single</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_FLASH_S</name>
                  <description>Bus Master Flash Single</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SHARED</name>
                  <description>Mailbox Shared</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SINGLE</name>
                  <description>Mailbox Single</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SPLIT</name>
                  <description>Mailbox Split</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OOB_SPLIT</name>
                  <description>Mailbox OOB Split</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OEM</name>
                  <description>Mailbox OEM</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Direction</name>
              <description>Meaning depends on Type, but generally picks the direction of the port (Host writes, Host reads, or both)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBIntAll</name>
              <description>Mailbox: Map interrupt on Read 1st and Write 1st to every read/write (special will still control 0th and last location)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>StallRd</name>
              <description>Stall on any Read of Index/Data and Mailbox (only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>StallWr</name>
              <description>Stall on any Write of Index/Data and Mailbox</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ErrorIgn</name>
              <description>If 1, the Host will get an error when trying to perform a read or write that is blocked by the Direction field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
