Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>LPC-Next0 Power Management Controller</description>
      <groupName>PMC</groupName>
      <baseAddress>0x40135000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PMC_PMIC</name>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>STATUS</name>
          <description>PMC status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ACTIVEFSM</name>
              <description>General sequencer and finite state machine status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVEFSM_0</name>
                  <description>All PMC finite state machines are idle. OK to set APPLYCFG to trigger the PMC state machines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVEFSM_1</name>
                  <description>One or more PMC finite state machines are active, do not set APPLYCFG or write to any PDRUNCFG or CTRL register values that are used by the PMC state machines.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLAGS</name>
          <description>Wakeup, interrupt, and reset flags</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x170000</resetValue>
          <resetMask>0xF9570000</resetMask>
          <fields>
            <field>
              <name>PORCOREF</name>
              <description>vddcore POR Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORCOREF_0</name>
                  <description>vddcore POR was not tripped since the last cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORCOREF_1</name>
                  <description>POR triggered by the vddcore POR monitor. Write 1 to clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR1V8F</name>
              <description>vdd1v8 power on reset flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR1V8F_0</name>
                  <description>No vdd1v8 power on event detected since last cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR1V8F_1</name>
                  <description>vdd1v8 power on detect caused a reset or deep pd wakeup. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORAO18F</name>
              <description>vdd_ao18 power on reset flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORAO18F_0</name>
                  <description>No vdd_ao18 power on event detected since last cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORAO18F_1</name>
                  <description>vdd_ao18 power on detect caused a reset. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDCOREF</name>
              <description>vddcore Low-Voltage Detector Flag This flag is set when a low voltage event was detected by the vddcore LVD monitor and it is enabled for interrupt or reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDCOREF_0</name>
                  <description>vddcore LVD has not triggered an interrupt or reset since last clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDCOREF_1</name>
                  <description>vddcore LVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDCOREF</name>
              <description>vddcore High-Voltage Detector Flag This flag is set when a high-voltage event was detected by the vddcore HVD monitor and it is enabled for interrupt or reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDCOREF_0</name>
                  <description>vddcore HVD has not triggered an interrupt or reset since last clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDCOREF_1</name>
                  <description>vddcore HVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVD1V8F</name>
              <description>vdd1v8 High-Voltage Detector Flag This flag is set when a high-voltage event was detected by the vdd1v8 HVD monitor and it is enabled for interrupt or reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVD1V8F_0</name>
                  <description>vdd1v8 HVD has not triggered an interrupt or reset since last clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVD1V8F_1</name>
                  <description>vdd1v8 HVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCF</name>
              <description>RTC Wakeup from deep powerdown mode flag.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCF_0</name>
                  <description>No RTC wakeup detected since last time flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCF_1</name>
                  <description>RTC wakeup caused a deep powerdown wakeup. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOWKF</name>
              <description>PMC Auto Wakeup Interrupt flag.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOWKF_0</name>
                  <description>No PMC Auto Wakeup Interrupt detected since last time cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWKF_1</name>
                  <description>PMC Auto wakeup caused a deep sleep wakeup and interrupt. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTNPADF</name>
              <description>PMIC interrupt pin flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTNPADF_0</name>
                  <description>No interrupt detected since flag last cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTNPADF_1</name>
                  <description>Pad interrupt caused a wakeup or interrupt event since the last time this flag was cleared. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETNPADF</name>
              <description>Reset pad flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESETNPADF_0</name>
                  <description>No reset detected since last time this flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESETNPADF_1</name>
                  <description>Reset pad wakeup caused a wakeup or reset event since the last time this bit was cleared. Write 1 to clear.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEEPPDF</name>
              <description>Deep powerdown wakeup flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEPPDF_0</name>
                  <description>No deep powerdown wakeup since last time flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPDF_1</name>
                  <description>Deep powerdown was entered since the last time this flag was cleared. Write 1 to clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>PMC control register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200000</resetValue>
          <resetMask>0x33F000F1</resetMask>
          <fields>
            <field>
              <name>APPLYCFG</name>
              <description>Apply updated PMC PDRUNCFG bits (SRAM power gates, RBB, FBB, LVD, and HVD control bits) and/or RUNCTRL setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APPLYCFG_0</name>
                  <description>Always reads 0. Write 0 has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APPLYCFG_1</name>
                  <description>Write 1 = initiate update sequencing of PMC state machines</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFEN</name>
              <description>Enable analog buffer for references or ATX2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFEN_0</name>
                  <description>disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFEN_1</name>
                  <description>enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDCOREIE</name>
              <description>vddcore Low-Voltage Detector Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDCOREIE_0</name>
                  <description>vddcore LVD interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDCOREIE_1</name>
                  <description>vddcore LVD causes interrupt and wakeup from deep sleep.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDCORERE</name>
              <description>vddcore Low-Voltage Detector Reset Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDCORERE_0</name>
                  <description>vddcore LVD reset disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDCORERE_1</name>
                  <description>vddcore LVD causes reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDCOREIE</name>
              <description>vddcore High-Voltage Detector Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDCOREIE_0</name>
                  <description>vddcore HVD interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDCOREIE_1</name>
                  <description>vddcore HVD causes interrupt and wakeup from deep sleep.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDCORERE</name>
              <description>vddcore High-Voltage Detector Reset Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDCORERE_0</name>
                  <description>vddcore HVD reset disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDCORERE_1</name>
                  <description>vddcore HVD causes reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVD1V8IE</name>
              <description>vdd1v8 High-Voltage Detector Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVD1V8IE_0</name>
                  <description>vdd1v8 HVD interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVD1V8IE_1</name>
                  <description>vdd1v8 HVD causes interrupt and wakeup from deep sleep or deep power down mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVD1V8RE</name>
              <description>vdd1v8 High-Voltage Detector Reset Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVD1V8RE_0</name>
                  <description>vdd1v8 HVD reset disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVD1V8RE_1</name>
                  <description>vdd1v8 HVD causes reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOWKEN</name>
              <description>PMC automatic wakeup enable and interrupt enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOWKEN_0</name>
                  <description>Auto wakeup interrupt and counter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWKEN_1</name>
                  <description>Auto wakeup interrupt generated when PMC sequencer finishes and AUTOWAKE counter = 0 after entering deep sleep mode (but not deep powerdown mode). Interrupt will wake up the M33.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTRPADEN</name>
              <description>PMIC interrupt pin enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTRPADEN_0</name>
                  <description>Interrupt pad low has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRPADEN_1</name>
                  <description>Interrupt pad low triggers an interrupt and deep sleep wakeup or deep powerdown wakeup event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RUNCTRL</name>
          <description>PMC controls used during run mode</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x21</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>CORELVL</name>
              <description>Vddcore voltage value when SYSCTL is in run mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCTRL</name>
          <description>PMC controls used during deep sleep mode</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x21</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>CORELVL</name>
              <description>Vddcore voltage value when SYSCTL is in sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVDCORECTRL</name>
          <description>Active vddcore LVD monitor trip adjust</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>LVDCORELVL</name>
              <description>Vddcore LVD falling trip voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOWKUP</name>
          <description>Automatic wakeup from deepsleep / deep powerdown modes</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AUTOWKTIME</name>
              <description>Auto wake up delay timer. Added delay after sequencer delay value: delay time = value/16MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
