Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>PMICCFG</name>
          <description>PMIC power mode select control configuration to let PMC know when vddcore or vdd1v8 will power off/on</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x73</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VDDCOREM0</name>
              <description>vddcore state in PMIC mode 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDCOREM0_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDCOREM0_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDCOREM1</name>
              <description>vddcore state in PMIC mode 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDCOREM1_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDCOREM1_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDCOREM2</name>
              <description>vddcore state in PMIC mode 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDCOREM2_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDCOREM2_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDCOREM3</name>
              <description>vddcore state in PMIC mode 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDCOREM3_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDCOREM3_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD1V8M0</name>
              <description>vdd1v8 state in PMIC mode 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1V8M0_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1V8M0_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD1V8M1</name>
              <description>vdd1v8 state in PMIC mode 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1V8M1_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1V8M1_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD1V8M2</name>
              <description>vdd1v8 state in PMIC mode 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1V8M2_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1V8M2_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD1V8M3</name>
              <description>vdd1v8 state in PMIC mode 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD1V8M3_0</name>
                  <description>off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD1V8M3_1</name>
                  <description>powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADVRANGE</name>
          <description>GPIO vdde range selection control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>VDDIO_0RANGE</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDIO_0RANGE_0</name>
                  <description>1.71 - 3.6V. Consumes static current to detect VDDE0 level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_0RANGE_1</name>
                  <description>1.71 - 1.98V, vdde detector off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_0RANGE_2</name>
                  <description>3.00 - 3.6V, vdde detector off</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_0RANGE_3</name>
                  <description>Not allowed (hardware should translate to 10)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO_1RANGE</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDIO_1RANGE_0</name>
                  <description>1.71-3.6V. Consumes static current to detect VDDE1 level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_1RANGE_1</name>
                  <description>1.71 - 1.98V, vdde detector off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_1RANGE_2</name>
                  <description>3.00 - 3.6V, vdde detector off</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_1RANGE_3</name>
                  <description>Not allowed (hardware should translate to 10)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO_2RANGE</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDIO_2RANGE_0</name>
                  <description>1.71 - 3.6V. Consumes static current to detect VDDE2 level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_2RANGE_1</name>
                  <description>1.71 - 1.98V, vdde detector off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_2RANGE_2</name>
                  <description>3.00 - 3.6V, vdde detector off</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_2RANGE_3</name>
                  <description>Not allowed (hardware should translate to 10)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMSEQCTRL</name>
          <description>Memory Sequencer Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>MEMSEQNUM</name>
              <description>Number of memories to turn on/off at a time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
