Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>USDHC0</name>
      <description>uSDHC</description>
      <groupName>USDHC</groupName>
      <headerStructName>USDHC</headerStructName>
      <baseAddress>0x40136000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xD0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USDHC0</name>
        <value>45</value>
      </interrupt>
      <registers>
        <register>
          <name>DS_ADDR</name>
          <description>DMA System Address</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DS_ADDR</name>
              <description>DS_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK_ATT</name>
          <description>Block Attributes</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLKSIZE</name>
              <description>Block Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLKSIZE_0</name>
                  <description>No data transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_1</name>
                  <description>1 Byte</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_2</name>
                  <description>2 Bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_3</name>
                  <description>3 Bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_4</name>
                  <description>4 Bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_511</name>
                  <description>511 Bytes</description>
                  <value>0x1FF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_512</name>
                  <description>512 Bytes</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_2048</name>
                  <description>2048 Bytes</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_4096</name>
                  <description>4096 Bytes</description>
                  <value>0x1000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKCNT</name>
              <description>Block Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLKCNT_0</name>
                  <description>Stop Count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_1</name>
                  <description>1 block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_2</name>
                  <description>2 blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_65535</name>
                  <description>65535 blocks</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_ARG</name>
          <description>Command Argument</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>Command Argument</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_XFR_TYP</name>
          <description>Command Transfer Type</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSPTYP</name>
              <description>Response Type Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSPTYP_0</name>
                  <description>No Response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_1</name>
                  <description>Response Length 136</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_2</name>
                  <description>Response Length 48</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_3</name>
                  <description>Response Length 48, check Busy after response</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCCEN</name>
              <description>Command CRC Check Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCCEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCCEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CICEN</name>
              <description>Command Index Check Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CICEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPSEL</name>
              <description>Data Present Select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPSEL_0</name>
                  <description>No Data Present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPSEL_1</name>
                  <description>Data Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDTYP</name>
              <description>Command Type</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMDTYP_0</name>
                  <description>Normal Other commands</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_1</name>
                  <description>Suspend CMD52 for writing Bus Suspend in CCCR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_2</name>
                  <description>Resume CMD52 for writing Function Select in CCCR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_3</name>
                  <description>Abort CMD12, CMD52 for writing I/O Abort in CCCR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDINX</name>
              <description>Command Index</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP0</name>
          <description>Command Response0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP0</name>
              <description>Command Response 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP1</name>
          <description>Command Response1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP1</name>
              <description>Command Response 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP2</name>
          <description>Command Response2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP2</name>
              <description>Command Response 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP3</name>
          <description>Command Response3</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP3</name>
              <description>Command Response 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_BUFF_ACC_PORT</name>
          <description>Data Buffer Access Port</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATCONT</name>
              <description>Data Content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
