Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>MMC_BOOT</name>
          <description>MMC Boot Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTOCV_ACK</name>
              <description>DTOCV_ACK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOCV_ACK_0</name>
                  <description>SDCLK x 2^14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_1</name>
                  <description>SDCLK x 2^15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_2</name>
                  <description>SDCLK x 2^16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_3</name>
                  <description>SDCLK x 2^17</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_4</name>
                  <description>SDCLK x 2^18</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_5</name>
                  <description>SDCLK x 2^19</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_6</name>
                  <description>SDCLK x 2^20</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_7</name>
                  <description>SDCLK x 2^21</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_14</name>
                  <description>SDCLK x 2^28</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_ACK_15</name>
                  <description>SDCLK x 2^29</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_ACK</name>
              <description>BOOT_ACK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_ACK_0</name>
                  <description>No ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_ACK_1</name>
                  <description>Ack</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_MODE</name>
              <description>BOOT_MODE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_MODE_0</name>
                  <description>Normal boot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_MODE_1</name>
                  <description>Alternative boot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_EN</name>
              <description>BOOT_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_EN_0</name>
                  <description>Fast boot disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_EN_1</name>
                  <description>Fast boot enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTO_SABG_EN</name>
              <description>AUTO_SABG_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_TIME_OUT</name>
              <description>Disable Time Out</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_TIME_OUT_0</name>
                  <description>Enable time out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_TIME_OUT_1</name>
                  <description>Disable time out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_BLK_CNT</name>
              <description>BOOT_BLK_CNT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VEND_SPEC2</name>
          <description>Vendor Specific 2 Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CARD_INT_D3_TEST</name>
              <description>Card Interrupt Detection Test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CARD_INT_D3_TEST_0</name>
                  <description>Check the card interrupt only when DATA3 is high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CARD_INT_D3_TEST_1</name>
                  <description>Check the card interrupt by ignoring the status of DATA3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TUNING_8bit_EN</name>
              <description>TUNING_8bit_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_1bit_EN</name>
              <description>TUNING_1bit_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_CMD_EN</name>
              <description>TUNING_CMD_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TUNING_CMD_EN_0</name>
                  <description>Auto tuning circuit does not check the CMD line.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNING_CMD_EN_1</name>
                  <description>Auto tuning circuit checks the CMD line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS400_WR_CLK_STOP_EN</name>
              <description>HS400 Write Clock Stop Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS400_RD_CLK_STOP_EN</name>
              <description>HS400 Read Clock Stop Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMD23_ARGU2_EN</name>
              <description>Argument2 register enable for ACMD23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMD23_ARGU2_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMD23_ARGU2_EN_1</name>
                  <description>Argument2 register enable for ACMD23 sharing with SDMA system address register. Default is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_RST</name>
              <description>AHB BUS reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TUNING_CTRL</name>
          <description>Tuning Control Register</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x212800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNING_START_TAP</name>
              <description>TUNING_START_TAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_COUNTER</name>
              <description>TUNING_COUNTER</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_STEP</name>
              <description>TUNING_STEP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_WINDOW</name>
              <description>TUNING_WINDOW</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STD_TUNING_EN</name>
              <description>STD_TUNING_EN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
