Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TCTRL[%s]</name>
          <description>Trigger Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HTEN</name>
              <description>Trigger enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HTEN_0</name>
                  <description>Hardware trigger source disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HTEN_1</name>
                  <description>Hardware trigger source enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPRI</name>
              <description>Trigger priority setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TPRI_0</name>
                  <description>Set to highest priority, Level 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_1</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_2</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_3</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_4</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_5</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_6</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_7</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_8</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_9</name>
                  <description>Set to corresponding priority level</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPRI_15</name>
                  <description>Set to lowest priority, Level 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDLY</name>
              <description>Trigger delay select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCMD</name>
              <description>Trigger command select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMD_0</name>
                  <description>Not a valid selection from the command buffer. Trigger event is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_1</name>
                  <description>CMD1 is executed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_2</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_3</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_4</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_5</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_6</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_7</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_8</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_9</name>
                  <description>Corresponding CMD is executed</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCMD_15</name>
                  <description>CMD15 is executed</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDL1</name>
          <description>ADC Command Low Buffer Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>Select CH0A or CH0B or CH0A/CH0B pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>Select CH1A or CH1B or CH1A/CH1B pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>Select CH2A or CH2B or CH2A/CH2B pair.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>Select CH3A or CH3B or CH3A/CH3B pair.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_30</name>
                  <description>Select CH30A or CH30B or CH30A/CH30B pair.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_31</name>
                  <description>Select CH31A or CH31B or CH31A/CH31B pair.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABSEL</name>
              <description>A-side vs. B-side Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABSEL_0</name>
                  <description>When DIFF=0b0, the associated A-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnA-CHnB).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABSEL_1</name>
                  <description>When DIFF=0b0, the associated B-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnB-CHnA).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFF</name>
              <description>Differential Mode Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIFF_0</name>
                  <description>Single-ended mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFF_1</name>
                  <description>Differential mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCALE</name>
              <description>Channel Scale</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSCALE_0</name>
                  <description>Scale selected analog channel (Factor of 30/64)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSCALE_1</name>
                  <description>(Default) Full scale (Factor of 1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
