Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>CMDH15</name>
          <description>ADC Command High Buffer Register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LWI</name>
              <description>Loop with Increment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LWI_0</name>
                  <description>Auto channel increment disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LWI_1</name>
                  <description>Auto channel increment enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STS_0</name>
                  <description>Minimum sample time of 3 ADCK cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_1</name>
                  <description>3 + 2^1 ADCK cycles; 5 ADCK cycles total sample time.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_2</name>
                  <description>3 + 2^2 ADCK cycles; 7 ADCK cycles total sample time.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_3</name>
                  <description>3 + 2^3 ADCK cycles; 11 ADCK cycles total sample time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_4</name>
                  <description>3 + 2^4 ADCK cycles; 19 ADCK cycles total sample time.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_5</name>
                  <description>3 + 2^5 ADCK cycles; 35 ADCK cycles total sample time.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_6</name>
                  <description>3 + 2^6 ADCK cycles; 67 ADCK cycles total sample time.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STS_7</name>
                  <description>3 + 2^7 ADCK cycles; 131 ADCK cycles total sample time.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVGS_0</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_1</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_2</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_3</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_4</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_5</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_6</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_7</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Count Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOP_0</name>
                  <description>Looping not enabled. Command executes 1 time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_1</name>
                  <description>Loop 1 time. Command executes 2 times.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_2</name>
                  <description>Loop 2 times. Command executes 3 times.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_3</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_4</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_5</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_6</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_7</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_8</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_9</name>
                  <description>Loop corresponding number of times. Command executes LOOP+1 times.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP_15</name>
                  <description>Loop 15 times. Command executes 16 times.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEXT</name>
              <description>Next Command Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_0</name>
                  <description>No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_1</name>
                  <description>Select CMD1 command buffer register as next command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_2</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_3</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_4</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_5</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_6</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_7</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_8</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_9</name>
                  <description>Select corresponding CMD command buffer register as next command</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEXT_15</name>
                  <description>Select CMD15 command buffer register as next command.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4</dimIndex>
          <name>CV%s</name>
          <description>Compare Value Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CVL</name>
              <description>Compare Value Low.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVH</name>
              <description>Compare Value High.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESFIFO</name>
          <description>ADC Data Result FIFO Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSRC</name>
              <description>Trigger Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSRC_0</name>
                  <description>Trigger source 0 initiated this conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_1</name>
                  <description>Trigger source 1 initiated this conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_2</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_3</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_4</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_5</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_6</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_7</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_8</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_9</name>
                  <description>Corresponding trigger source initiated this conversion.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRC_15</name>
                  <description>Trigger source 15 initiated this conversion.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCNT</name>
              <description>Loop count value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOPCNT_0</name>
                  <description>Result is from initial conversion in command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_1</name>
                  <description>Result is from second conversion in command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_2</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_3</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_4</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_5</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_6</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_7</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_8</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_9</name>
                  <description>Result is from LOOPCNT+1 conversion in command.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPCNT_15</name>
                  <description>Result is from 16th conversion in command.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDSRC</name>
              <description>Command Buffer Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMDSRC_0</name>
                  <description>Not a valid value CMDSRC value for a dataword in RESFIFO. 0x0 is only found in initial FIFO state prior to an ADC conversion result dataword being stored to a RESFIFO buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_1</name>
                  <description>CMD1 buffer used as control settings for this conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_2</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_3</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_4</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_5</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_6</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_7</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_8</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_9</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDSRC_15</name>
                  <description>CMD15 buffer used as control settings for this conversion.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>FIFO entry is valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID_0</name>
                  <description>FIFO is empty. Discard any read from RESFIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_1</name>
                  <description>FIFO record read from RESFIFO is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
