Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>SEC_GPIO_MASK1</name>
          <description>Secure GPIO mask for port 1 pins.</description>
          <addressOffset>0xF84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO1_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO1_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO1_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO1_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO1_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO1_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO1_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO1_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO1_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO1_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO1_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO1_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO1_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO1_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO1_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO1_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO1_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO1_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO1_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO1_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO1_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO1_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO1_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO1_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO1_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO1_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO1_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO1_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO1_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO1_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO1_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO1_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO1_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO1_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_GPIO_MASK2</name>
          <description>Secure GPIO mask for port 2 pins.</description>
          <addressOffset>0xF88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO2_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO2_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO2_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO2_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO2_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO2_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO2_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO2_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO2_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO2_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO2_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO2_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO2_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO2_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO2_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO2_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO2_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO2_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO2_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO2_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO2_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO2_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO2_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO2_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO2_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO2_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO2_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO2_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO2_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO2_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO2_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO2_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO2_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO2_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
