Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>SEC_GPIO_MASK3</name>
          <description>Secure GPIO mask for port 3 pins.</description>
          <addressOffset>0xF8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO3_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO3_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO3_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO3_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO3_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO3_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO3_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO3_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO3_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO3_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO3_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO3_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO3_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO3_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO3_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO3_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO3_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO3_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO3_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO3_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO3_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO3_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO3_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO3_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO3_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO3_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO3_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO3_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO3_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO3_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO3_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO3_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO3_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO3_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_GPIO_MASK4</name>
          <description>Secure GPIO mask for port 4 pins.</description>
          <addressOffset>0xF90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO4_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO4_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO4_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO4_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO4_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO4_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO4_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO4_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO4_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO4_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO4_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO4_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO4_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO4_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO4_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO4_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO4_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO4_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO4_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO4_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO4_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO4_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO4_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO4_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO4_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO4_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO4_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO4_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO4_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO4_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO4_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO4_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO4_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO4_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
