Masmiseim36/nxpSDK/devices/MIMXRT633S/MIMXRT633S.xml
        <register>
          <name>SEC_GPIO_MASK7</name>
          <description>Secure GPIO mask for port 7 pins.</description>
          <addressOffset>0xF9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO7_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO7_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO7_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO7_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO7_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO7_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO7_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO7_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO7_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO7_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO7_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO7_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO7_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO7_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO7_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO7_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO7_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO7_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO7_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO7_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO7_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO7_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO7_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO7_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO7_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO7_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO7_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO7_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO7_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO7_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO7_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO7_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO7_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO7_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_DSP_INT_MASK</name>
          <description>secure general purpose register 8 used to mask interrupts to DSP for security purpose</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFE0</resetValue>
          <resetMask>0xFFFFFFE0</resetMask>
          <fields>
            <field>
              <name>DSP_INTR5_SEC_MASK</name>
              <description>0: INTR5 is invisible to DSP, 1: INTR5 is visible to DSP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR6_SEC_MASK</name>
              <description>0: INTR6 is invisible to DSP, 1: INTR6 is visible to DSP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR7_SEC_MASK</name>
              <description>0: INTR7 is invisible to DSP, 1: INTR7 is visible to DSP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR8_SEC_MASK</name>
              <description>0: INTR8 is invisible to DSP, 1: INTR8 is visible to DSP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR9_SEC_MASK</name>
              <description>0: INTR9 is invisible to DSP, 1: INTR9 is visible to DSP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR10_SEC_MASK</name>
              <description>0: INTR10 is invisible to DSP, 1: INTR10 is visible to DSP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR11_SEC_MASK</name>
              <description>0: INTR11 is invisible to DSP, 1: INTR11 is visible to DSP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR12_SEC_MASK</name>
              <description>0: INTR12 is invisible to DSP, 1: INTR12 is visible to DSP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR13_SEC_MASK</name>
              <description>0: INTR13 is invisible to DSP, 1: INTR13 is visible to DSP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR14_SEC_MASK</name>
              <description>0: INTR14 is invisible to DSP, 1: INTR14 is visible to DSP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR15_SEC_MASK</name>
              <description>0: INTR15 is invisible to DSP, 1: INTR15 is visible to DSP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR16_SEC_MASK</name>
              <description>0: INTR16 is invisible to DSP, 1: INTR16 is visible to DSP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR17_SEC_MASK</name>
              <description>0: INTR17 is invisible to DSP, 1: INTR17 is visible to DSP</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR18_SEC_MASK</name>
              <description>0: INTR18 is invisible to DSP, 1: INTR18 is visible to DSP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR19_SEC_MASK</name>
              <description>0: INTR19 is invisible to DSP, 1: INTR19 is visible to DSP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR20_SEC_MASK</name>
              <description>0: INTR20 is invisible to DSP, 1: INTR20 is visible to DSP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR21_SEC_MASK</name>
              <description>0: INTR21 is invisible to DSP, 1: INTR21 is visible to DSP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR22_SEC_MASK</name>
              <description>0: INTR22 is invisible to DSP, 1: INTR22 is visible to DSP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR23_SEC_MASK</name>
              <description>0: INTR23 is invisible to DSP, 1: INTR23 is visible to DSP</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR24_SEC_MASK</name>
              <description>0: INTR24 is invisible to DSP, 1: INTR24 is visible to DSP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR25_SEC_MASK</name>
              <description>0: INTR25 is invisible to DSP, 1: INTR25 is visible to DSP</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR26_SEC_MASK</name>
              <description>0: INTR26 is invisible to DSP, 1: INTR26 is visible to DSP</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR27_SEC_MASK</name>
              <description>0: INTR27 is invisible to DSP, 1: INTR27 is visible to DSP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR28_SEC_MASK</name>
              <description>0: INTR28 is invisible to DSP, 1: INTR28 is visible to DSP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR29_SEC_MASK</name>
              <description>0: INTR29 is invisible to DSP, 1: INTR29 is visible to DSP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR30_SEC_MASK</name>
              <description>0: INTR30 is invisible to DSP, 1: INTR30 is visible to DSP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSP_INTR31_SEC_MASK</name>
              <description>0: INTR31 is invisible to DSP, 1: INTR31 is visible to DSP</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
